guangli2015/freertos_nRF54l15/Source/bm_buttons/bm_buttons.h
/*
 * Copyright (c) 2012-2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

/** @file
 *
 * @defgroup bm_buttons NCS Bare Metal Buttons library
 * @{
 *
 * @brief Buttons management module.
 *
 * @details The bm_buttons library uses the nrfx_gpiote to detect that a button has been
 *          pressed. To handle debouncing, it will start a bm_timer.
 *          The button will only be reported as pressed if the corresponding pin is still active
 *          when the timer expires.
 *          If there is a new GPIOTE event while the timer is running, the timer is restarted.
 */

#ifndef BM_BUTTONS_H__
#define BM_BUTTONS_H__

#include <stdint.h>
#include <stdbool.h>


#include <nrfx_gpiote.h>

#ifdef __cplusplus
extern "C" {
#endif


enum bm_buttons_evt_type {
	/* Indicates that a button is released. */
	BM_BUTTONS_RELEASE = 0,
	/* Indicates that a button is pressed. */
	BM_BUTTONS_PRESS = 1
};

enum bm_buttons_active_state {
	/* Indicates that a button is active low. */
	BM_BUTTONS_ACTIVE_LOW = 0,
	/* Indicates that a button is active high. */
	BM_BUTTONS_ACTIVE_HIGH = 1
};

/**
 * @brief Enumerator used for selecting the pin to be pulled down or up at the time of pin
 *        configuration.
 */
enum bm_buttons_pin_pull {
	/* Pin pull-up resistor disabled. */
	BM_BUTTONS_PIN_NOPULL = NRF_GPIO_PIN_NOPULL,
	/* Pin pull-down resistor enabled. */
	BM_BUTTONS_PIN_PULLDOWN = NRF_GPIO_PIN_PULLDOWN,
	/* Pin pull-up resistor enabled. */
	BM_BUTTONS_PIN_PULLUP = NRF_GPIO_PIN_PULLUP,
};

/**
 * @brief Button event handler type.
 */
typedef void (*bm_buttons_handler_t)(uint8_t pin_number, enum bm_buttons_evt_type action);

/**
 * @brief Button configuration.
 */
struct bm_buttons_config {
	/* Pin to be used as a button. */
	uint8_t pin_number;
	/* BM_BUTTONS_ACTIVE_HIGH or BM_BUTTONS_ACTIVE_LOW. */
	enum bm_buttons_active_state active_state;
	/* Pull-up or pull-down configuration. */
	enum bm_buttons_pin_pull pull_config;
	/* Handler to be called when the button is pressed. */
	bm_buttons_handler_t handler;
};

/**
 * @brief Initialize buttons.
 *
 * @details This function will initialize the specified pins as buttons, and configure them.
 *
 * @note After this function returns, the @p configs configurations will still be referenced
 *       internally by the library. It is the user's responsibility to ensure that the @p configs
 *       configurations remain valid and exist until the end of the program or until
 *       @ref bm_buttons_deinit is called.
 *       If the @p configs configurations are altered or destroyed prematurely, it will result in
 *       undefined behavior.
 *
 * @note The @ref bm_buttons_enable function must be called in order to enable the button
 *       detection.
 *
 * @param[in] configs Array of button configurations to be used.
 * @param[in] num_configs Number of button configurations.
 * @param[in] detection_delay Delay (in microseconds) from a GPIOTE event until a button
 *                            is reported as pressed. Must be higher than
 *                            @ref BM_BUTTONS_DETECTION_DELAY_MIN_US.
 *
 * @retval 0 on success.
 * @retval -EPERM If the bm_buttons library is already initialized.
 * @retval -EINVAL If input data is invalid.
 * @retval -EIO If an error occurred.
 */
int bm_buttons_init(const struct bm_buttons_config *configs, uint8_t num_configs,
		    uint32_t detection_delay);



/**
 * @brief Enable button detection.
 *
 * @retval 0 on success.
 * @retval -EPERM If the bm_buttons library is not initialized.
 */
int bm_buttons_enable(void);



#ifdef __cplusplus
}
#endif

#endif /* BM_BUTTONS_H__ */

/** @} */
